## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                      NAME                                                      |
|--------|----------------------------------------------------------------------------------------------------------------|
| add    | `aws_identitystore_group.forms_production_athena_query_access`                                                 |
|        | `aws_identitystore_group.forms_staging_athena_query_access`                                                    |
|        | `aws_ssoadmin_account_assignment.forms_production[&quot;Forms-Production-Athena-Query-Access-Athena-Query-Access&quot;]` |
|        | `aws_ssoadmin_account_assignment.forms_staging[&quot;Forms-Staging-Athena-Query-Access-Athena-Query-Access&quot;]`       |
|        | `aws_ssoadmin_permission_set.athena_query_access`                                                              |
|        | `aws_ssoadmin_permission_set_inline_policy.athena_query_access`                                                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group.forms_production_athena_query_access will be created
  + resource "aws_identitystore_group" "forms_production_athena_query_access" {
      + description       = "Grants members access to run Athena queries in the GC Forms Production account."
      + display_name      = "Forms-Production-Athena-Query-Access"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.forms_staging_athena_query_access will be created
  + resource "aws_identitystore_group" "forms_staging_athena_query_access" {
      + description       = "Grants members access to run Athena queries in the GC Forms Staging account."
      + display_name      = "Forms-Staging-Athena-Query-Access"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_ssoadmin_account_assignment.forms_production["Forms-Production-Athena-Query-Access-Athena-Query-Access"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "957818836222"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.forms_staging["Forms-Staging-Athena-Query-Access-Athena-Query-Access"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "687401027353"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_permission_set.athena_query_access will be created
  + resource "aws_ssoadmin_permission_set" "athena_query_access" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Grants access to the Athena query editor and RDS connector Lambda functions."
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + name             = "Athena-Query-Access"
      + session_duration = "PT1H"
      + tags_all         = (known after apply)
    }

  # aws_ssoadmin_permission_set_inline_policy.athena_query_access will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "athena_query_access" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "athena:StopQueryExecution",
                          + "athena:StartQueryExecution",
                          + "athena:ListWorkGroups",
                          + "athena:ListTableMetadata",
                          + "athena:ListQueryExecutions",
                          + "athena:ListNamedQueries",
                          + "athena:ListDatabases",
                          + "athena:ListDataCatalogs",
                          + "athena:GetWorkGroup",
                          + "athena:GetQueryResultsStream",
                          + "athena:GetQueryResults",
                          + "athena:GetQueryExecution",
                          + "athena:GetNamedQuery",
                          + "athena:GetDataCatalog",
                          + "athena:BatchGetQueryExecution",
                          + "athena:BatchGetNamedQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AthenaRead"
                    },
                  + {
                      + Action   = [
                          + "glue:GetTables",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:GetPartition",
                          + "glue:GetDatabases",
                          + "glue:GetDatabase",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GlueRead"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListMultipartUploadParts",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::forms-staging-athena-bucket/*",
                          + "arn:aws:s3:::forms-staging-athena-bucket",
                          + "arn:aws:s3:::forms-production-athena-bucket/*",
                          + "arn:aws:s3:::forms-production-athena-bucket",
                        ]
                      + Sid      = "AthenaS3Results"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cbs-satellite-957818836222/*",
                          + "arn:aws:s3:::cbs-satellite-957818836222",
                          + "arn:aws:s3:::cbs-satellite-687401027353/*",
                          + "arn:aws:s3:::cbs-satellite-687401027353",
                        ]
                      + Sid      = "AthenaS3ReadLogs"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "BaseS3BucketPermissions"
                    },
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:lambda:ca-central-1:957818836222:function:*-lambda-connector",
                          + "arn:aws:lambda:ca-central-1:687401027353:function:*-lambda-connector",
                        ]
                      + Sid      = "InvokeAthenaConnectorLambda"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_pinpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_route53_notify_hosted_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_support_center"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.athena_query_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.canadian_digital_service_production_website_admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.notify_access_ecs_blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.rds_query_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.read_only_billing"]

29 tests, 19 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
